#pragma once

// Unreal Engine 3 (3) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE3_UDKBase_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UDKBase.ParticleModuleTypeDataSnow
// 0x00E4 (0x0150 - 0x006C)
class UParticleModuleTypeDataSnow : public UParticleModuleTypeDataBase
{
public:
	struct FRawDistributionVector                      StartSize;                                                // 0x006C(0x0024) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      StartVelocity;                                            // 0x0090(0x0024) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      StartLocation;                                            // 0x00B4(0x0024) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      ColorOverLife;                                            // 0x00D8(0x0024) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       AlphaOverLife;                                            // 0x00FC(0x0024) (Edit, Component, NeedCtorLink)
	struct FRawDistributionFloat                       Lifetime;                                                 // 0x0120(0x0024) (Edit, Component, NeedCtorLink)
	float                                              KillHeight;                                               // 0x0144(0x0004) (Edit)
	float                                              FadeStart;                                                // 0x0148(0x0004) (Edit)
	float                                              FadeStop;                                                 // 0x014C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.ParticleModuleTypeDataSnow");
		return ptr;
	}

};


// Class UDKBase.SimpleGame
// 0x0000 (0x04AC - 0x04AC)
class ASimpleGame : public AFrameworkGame
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.SimpleGame");
		return ptr;
	}


	class UClass* STATIC_SetGameType(const struct FString& MapName, const struct FString& Options, const struct FString& Portal);
	struct FString STATIC_StripPlayOnPrefix(const struct FString& MapName);
};


// Class UDKBase.UDKGame
// 0x0000 (0x04AC - 0x04AC)
class AUDKGame : public ASimpleGame
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKGame");
		return ptr;
	}

};


// Class UDKBase.UDKAIDecisionComponent
// 0x0007 (0x008C - 0x0085)
class UUDKAIDecisionComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
	unsigned long                                      bTriggered : 1;                                           // 0x0088(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKAIDecisionComponent");
		return ptr;
	}

};


// Class UDKBase.UDKBot
// 0x00FC (0x055C - 0x0460)
class AUDKBot : public AAIController
{
public:
	class AUDKSquadAI*                                 Squad;                                                    // 0x0460(0x0008)
	class UUDKAIDecisionComponent*                     DecisionComponent;                                        // 0x0468(0x0008) (ExportObject, Component, EditInline)
	class AActor*                                      TemporaryFocus;                                           // 0x0470(0x0008)
	unsigned long                                      bExecutingWhatToDoNext : 1;                               // 0x0478(0x0004)
	unsigned long                                      bScriptSpecialJumpCost : 1;                               // 0x0478(0x0004)
	unsigned long                                      bForceRefreshRoute : 1;                                   // 0x0478(0x0004)
	unsigned long                                      bTargetAlternateLoc : 1;                                  // 0x0478(0x0004)
	unsigned long                                      bEnemyInfoValid : 1;                                      // 0x0478(0x0004)
	unsigned long                                      bEnemyIsVisible : 1;                                      // 0x0478(0x0004)
	unsigned long                                      bLeadTarget : 1;                                          // 0x0478(0x0004)
	unsigned long                                      bJumpOverWall : 1;                                        // 0x0478(0x0004)
	unsigned long                                      bPlannedJump : 1;                                         // 0x0478(0x0004)
	unsigned long                                      bInDodgeMove : 1;                                         // 0x0478(0x0004)
	unsigned long                                      bEnemyAcquired : 1;                                       // 0x0478(0x0004)
	unsigned long                                      bNeedDelayedLeaveVehicle : 1;                             // 0x0478(0x0004)
	unsigned long                                      bAllowRouteReuse : 1;                                     // 0x0478(0x0004)
	unsigned long                                      bUsingSquadRoute : 1;                                     // 0x0478(0x0004)
	unsigned long                                      bUsePreviousSquadRoute : 1;                               // 0x0478(0x0004)
	unsigned char                                      ScriptedFireMode;                                         // 0x047C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x047D(0x0003) MISSED OFFSET
	float                                              EnemyVisibilityTime;                                      // 0x0480(0x0004)
	class APawn*                                       VisibleEnemy;                                             // 0x0484(0x0008)
	class AVehicle*                                    LastBlockingVehicle;                                      // 0x048C(0x0008)
	class APawn*                                       CurrentlyTrackedEnemy;                                    // 0x0494(0x0008)
	TArray<struct FEnemyPosition>                      SavedPositions;                                           // 0x049C(0x0010) (NeedCtorLink)
	struct FVector                                     ImpactVelocity;                                           // 0x04AC(0x000C)
	int                                                AcquisitionYawRate;                                       // 0x04B8(0x0004)
	float                                              HearingThreshold;                                         // 0x04BC(0x0004)
	float                                              RespawnPredictionTime;                                    // 0x04C0(0x0004)
	float                                              WarningDelay;                                             // 0x04C4(0x0004)
	class AProjectile*                                 WarningProjectile;                                        // 0x04C8(0x0008)
	struct FVector                                     MonitorStartLoc;                                          // 0x04D0(0x000C)
	class APawn*                                       MonitoredPawn;                                            // 0x04DC(0x0008)
	float                                              MonitorMaxDistSq;                                         // 0x04E4(0x0004)
	struct FVector                                     LastSeenPos;                                              // 0x04E8(0x000C)
	struct FVector                                     LastSeeingPos;                                            // 0x04F4(0x000C)
	float                                              LastSeenTime;                                             // 0x0500(0x0004)
	float                                              TrackingReactionTime;                                     // 0x0504(0x0004)
	float                                              BaseTrackingReactionTime;                                 // 0x0508(0x0004)
	struct FVector                                     TrackedVelocity;                                          // 0x050C(0x000C)
	class ANavigationPoint*                            SquadRouteGoal;                                           // 0x0518(0x0008)
	class APawn*                                       BlockedAimTarget;                                         // 0x0520(0x0008)
	float                                              LastIterativeCheck;                                       // 0x0528(0x0004)
	float                                              AimUpdateFrequency;                                       // 0x052C(0x0004)
	float                                              LastAimUpdateTime;                                        // 0x0530(0x0004)
	float                                              ErrorUpdateFrequency;                                     // 0x0534(0x0004)
	float                                              LastErrorUpdateTime;                                      // 0x0538(0x0004)
	float                                              CurrentAimError;                                          // 0x053C(0x0004)
	float                                              DodgeLandZ;                                               // 0x0540(0x0004)
	class AActor*                                      FearSpots[0x2];                                           // 0x0544(0x0008)
	float                                              DodgeToGoalPct;                                           // 0x0554(0x0004)
	float                                              MultiJumpZ;                                               // 0x0558(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKBot");
		return ptr;
	}


	void DelayedLeaveVehicle();
	void DelayedWarning();
	void MissedDodge();
	float AdjustAimError(float TargetDist, bool bInstantProj);
	float SuperDesireability(class APickupFactory* P);
	bool SpecialJumpCost(float RequiredJumpZ, float* Cost);
	void MayDodgeToMoveTarget();
	void TimeDJReset();
	void MonitoredPawnAlert();
	void WhatToDoNext();
	class AActor* FindBestSuperPickup(float MaxDist);
	void BuildSquadRoute();
	class AActor* FindPathToSquadRoute(bool bWeightDetours);
	class AActor* FindBestInventoryPath(float* MinWeight);
	bool CanMakePathTo(class AActor* A);
	void LatentWhatToDoNext();
	void WaitToSeeEnemy();
	void ReceiveRunOverWarning(class AUDKVehicle* V, float projSpeed, const struct FVector& VehicleDir);
	void ExecuteWhatToDoNext();
	class AActor* FaceActor(float StrafingModifier);
};


// Class UDKBase.UDKCarriedObject
// 0x0050 (0x02A0 - 0x0250)
class AUDKCarriedObject : public AActor
{
public:
	class ATeamInfo*                                   Team;                                                     // 0x0250(0x0008) (Net)
	class ANavigationPoint*                            LastAnchor;                                               // 0x0258(0x0008) (Const)
	float                                              LastValidAnchorTime;                                      // 0x0260(0x0004)
	class USkeletalMeshComponent*                      SkelMesh;                                                 // 0x0264(0x0008) (ExportObject, Component, EditInline)
	unsigned long                                      bHome : 1;                                                // 0x026C(0x0004) (Net)
	class AUDKGameObjective*                           HomeBase;                                                 // 0x0270(0x0008) (Net)
	struct FVector                                     HomeBaseOffset;                                           // 0x0278(0x000C)
	class AActor*                                      OldBase;                                                  // 0x0284(0x0008)
	class AActor*                                      OldBaseBase;                                              // 0x028C(0x0008)
	struct FVector                                     HUDLocation;                                              // 0x0294(0x000C)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKCarriedObject");
		return ptr;
	}


	unsigned char GetTeamNum();
	void OnBaseChainChanged();
	void NotReachableBy(class APawn* P);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
};


// Class UDKBase.UDKDataStore_GameSearchBase
// 0x0008 (0x00D8 - 0x00D0)
class UUDKDataStore_GameSearchBase : public UUIDataStore_OnlineGameSearch
{
public:
	class UUDKUIDataProvider_ServerDetails*            ServerDetailsProvider;                                    // 0x00D0(0x0008) (Transient)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKDataStore_GameSearchBase");
		return ptr;
	}


	bool HasExistingSearchResults();
	bool HasOutstandingQueries(bool bRestrictCheckToSelf);
	void OnSearchComplete(bool bWasSuccessful);
	bool SubmitGameSearch(unsigned char ControllerIndex, bool bInvalidateExistingSearchResults);
	void Init();
};


// Class UDKBase.UDKEmitCameraEffect
// 0x000C (0x0270 - 0x0264)
class AUDKEmitCameraEffect : public AEmitter
{
public:
	float                                              DistFromCamera;                                           // 0x0264(0x0004) (Edit)
	class AUDKPlayerController*                        Cam;                                                      // 0x0268(0x0008)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKEmitCameraEffect");
		return ptr;
	}


	void UpdateLocation(float CamFOVDeg, struct FVector* CamLoc, struct FRotator* CamRot);
	void RegisterCamera(class AUDKPlayerController* inCam);
	void Destroyed();
	void PostBeginPlay();
};


// Class UDKBase.UDKEmitterPool
// 0x0010 (0x02D0 - 0x02C0)
class AUDKEmitterPool : public AEmitterPool
{
public:
	TArray<struct FAttachedExplosionLight>             RelativeExplosionLights;                                  // 0x02C0(0x0010) (Component, NeedCtorLink)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKEmitterPool");
		return ptr;
	}


	class UUDKExplosionLight* SpawnExplosionLight(class UClass* LightClass, const struct FVector& SpawnLocation, class AActor* AttachToActor);
	void OnExplosionLightFinished(class UUDKExplosionLight* Light);
	class UParticleSystemComponent* SpawnEmitter(class UParticleSystem* EmitterTemplate, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, class AActor* AttachToActor, class AActor* InInstigator, int MaxDLEPooledReuses, bool bInheritScaleFromBase);
};


// Class UDKBase.UDKExplosionLight
// 0x0030 (0x0270 - 0x0240)
class UUDKExplosionLight : public UPointLightComponent
{
public:
	unsigned long                                      bCheckFrameRate : 1;                                      // 0x0240(0x0004)
	unsigned long                                      bInitialized : 1;                                         // 0x0240(0x0004)
	float                                              HighDetailFrameTime;                                      // 0x0244(0x0004) (Edit)
	float                                              Lifetime;                                                 // 0x0248(0x0004)
	int                                                TimeShiftIndex;                                           // 0x024C(0x0004)
	TArray<struct FLightValues>                        TimeShift;                                                // 0x0250(0x0010) (Edit, NeedCtorLink)
	struct FScriptDelegate                             __OnLightFinished__Delegate;                              // 0x0260(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0260(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKExplosionLight");
		return ptr;
	}


	void OnLightFinished(class UUDKExplosionLight* Light);
	void ResetLight();
};


// Class UDKBase.UDKForcedDirectionVolume
// 0x0030 (0x030C - 0x02DC)
class AUDKForcedDirectionVolume : public APhysicsVolume
{
public:
	class UClass*                                      TypeToForce;                                              // 0x02DC(0x0008) (Edit)
	unsigned long                                      bIgnoreHoverboards : 1;                                   // 0x02E4(0x0004) (Edit)
	unsigned long                                      bDenyExit : 1;                                            // 0x02E4(0x0004) (Edit)
	unsigned long                                      bBlockPawns : 1;                                          // 0x02E4(0x0004) (Edit)
	unsigned long                                      bBlockSpectators : 1;                                     // 0x02E4(0x0004) (Edit)
	class UArrowComponent*                             Arrow;                                                    // 0x02E8(0x0008) (Edit, Const, ExportObject, Component, EditInline)
	struct FVector                                     ArrowDirection;                                           // 0x02F0(0x000C)
	TArray<class AUDKVehicle*>                         TouchingVehicles;                                         // 0x02FC(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKForcedDirectionVolume");
		return ptr;
	}


	bool StopsProjectile(class AProjectile* P);
	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void ActorEnteredVolume(class AActor* Other);
	void PostBeginPlay();
};


// Class UDKBase.UDKGameInteraction
// 0x0004 (0x01D8 - 0x01D4)
class UUDKGameInteraction : public UUIInteraction
{
public:
	int                                                BlockUIInputSemaphore;                                    // 0x01D4(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKGameInteraction");
		return ptr;
	}


	void NotifyGameSessionEnded();
	void BlockUIInput(bool bBlock);
	void ClearUIInputBlocks();
	bool ShouldProcessUIInput();
};


// Class UDKBase.UDKGameObjective
// 0x0039 (0x03A1 - 0x0368)
class AUDKGameObjective : public ANavigationPoint
{
public:
	TArray<class ANavigationPoint*>                    ShootSpots;                                               // 0x0368(0x0010) (NeedCtorLink)
	unsigned long                                      bAllowOnlyShootable : 1;                                  // 0x0378(0x0004)
	unsigned long                                      bUnderAttack : 1;                                         // 0x0378(0x0004) (Net)
	struct FVector                                     HUDLocation;                                              // 0x037C(0x000C)
	class UTexture2D*                                  IconHudTexture;                                           // 0x0388(0x0008) (Const)
	struct FTextureCoordinates                         IconCoords;                                               // 0x0390(0x0010)
	unsigned char                                      DefenderTeamIndex;                                        // 0x03A0(0x0001) (Net)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKGameObjective");
		return ptr;
	}


	unsigned char GetTeamNum();
	void DrawIcon(class UCanvas* Canvas, const struct FVector& IconLocation, float IconWidth, float IconAlpha, class AUDKPlayerController* PlayerOwner, const struct FLinearColor& DrawColor);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	void TriggerFlagEvent(const struct FName& EventType, class AController* EventInstigator);
	bool BotNearObjective(class AAIController* C);
	class AActor* GetBestViewTarget();
	void ObjectiveChanged();
};


// Class UDKBase.UDKGameSettingsCommon
// 0x0000 (0x00E4 - 0x00E4)
class UUDKGameSettingsCommon : public UOnlineGameSettings
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKGameSettingsCommon");
		return ptr;
	}


	struct FString STATIC_BlobToString(struct FString* InBlob);
	bool STATIC_StringToBlob(struct FString* InString, struct FString* OutBlob);
};


// Class UDKBase.UDKGameViewportClient
// 0x0010 (0x01B0 - 0x01A0)
class UUDKGameViewportClient : public UGameViewportClient
{
public:
	struct FString                                     HintLocFileName;                                          // 0x01A0(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKGameViewportClient");
		return ptr;
	}


	struct FString LoadRandomLocalizedHintMessage(const struct FString& Category1Name, const struct FString& Category2Name);
};


// Class UDKBase.UDKHUD
// 0x0054 (0x06E0 - 0x068C)
class AUDKHUD : public AMobileHUD
{
public:
	class UFont*                                       GlowFonts[0x2];                                           // 0x068C(0x0008)
	float                                              PulseDuration;                                            // 0x069C(0x0004)
	float                                              PulseSplit;                                               // 0x06A0(0x0004)
	float                                              PulseMultiplier;                                          // 0x06A4(0x0004)
	struct FFontRenderInfo                             TextRenderInfo;                                           // 0x06A8(0x0028)
	class UFont*                                       ConsoleIconFont;                                          // 0x06D0(0x0008)
	class UFont*                                       BindTextFont;                                             // 0x06D8(0x0008)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKHUD");
		return ptr;
	}


	void STATIC_TranslateBindToFont(const struct FString& InBindStr, class UFont** DrawFont, struct FString* OutBindStr);
	void DrawGlowText(const struct FString& Text, float X, float Y, float MaxHeightInPixels, float PulseTime, bool bRightJustified);
};


// Class UDKBase.UDKJumpPad
// 0x002C (0x0394 - 0x0368)
class AUDKJumpPad : public ANavigationPoint
{
public:
	struct FVector                                     JumpVelocity;                                             // 0x0368(0x000C)
	class APathNode*                                   JumpTarget;                                               // 0x0374(0x0008) (Edit)
	class USoundCue*                                   JumpSound;                                                // 0x037C(0x0008) (Edit)
	float                                              JumpTime;                                                 // 0x0384(0x0004) (Edit)
	float                                              JumpAirControl;                                           // 0x0388(0x0004) (Edit)
	class UAudioComponent*                             JumpAmbientSound;                                         // 0x038C(0x0008) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKJumpPad");
		return ptr;
	}


	bool SuggestMovePreparation(class APawn* Other);
	void PostTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};


// Class UDKBase.UDKKActorBreakable
// 0x004C (0x03C4 - 0x0378)
class AUDKKActorBreakable : public AKActor
{
public:
	unsigned long                                      bHasHealth : 1;                                           // 0x0378(0x0004) (Edit)
	unsigned long                                      bDamageOnEncroachment : 1;                                // 0x0378(0x0004) (Edit)
	unsigned long                                      bResetDOEWhenAsleep : 1;                                  // 0x0378(0x0004) (Edit)
	unsigned long                                      bTakeDamageOnEncroachment : 1;                            // 0x0378(0x0004) (Edit)
	unsigned long                                      bBreakWhenCausingDamage : 1;                              // 0x0378(0x0004) (Edit)
	unsigned long                                      bBroken : 1;                                              // 0x0378(0x0004)
	int                                                Health;                                                   // 0x037C(0x0004) (Edit)
	int                                                EncroachDamage_Other;                                     // 0x0380(0x0004) (Edit)
	int                                                EncroachDamage_Self;                                      // 0x0384(0x0004) (Edit)
	class UClass*                                      DmgTypeClass;                                             // 0x0388(0x0008) (Edit)
	int                                                DOEResetThreshold;                                        // 0x0390(0x0004) (Edit)
	class UParticleSystem*                             BrokenTemplate;                                           // 0x0394(0x0008) (Edit)
	class AController*                                 InstigatorController;                                     // 0x039C(0x0008)
	struct FScriptDelegate                             __OnBreakApart__Delegate;                                 // 0x03A4(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03A4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __OnEncroach__Delegate;                                   // 0x03B4(0x000C) (NeedCtorLink)
	unsigned char                                      UnknownData01[0x4];                                       // 0x03B4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKKActorBreakable");
		return ptr;
	}


	void ReplicatedEvent(const struct FName& VarName);
	void BreakApart();
	bool EncroachingOn(class AActor* Other);
	void TakeDamage(int Damage, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	bool OnEncroach(class AActor* Other);
	void OnBreakApart();
};


// Class UDKBase.UDKMapInfo
// 0x0004 (0x0064 - 0x0060)
class UUDKMapInfo : public UMapInfo
{
public:
	float                                              VisibilityModifier;                                       // 0x0060(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKMapInfo");
		return ptr;
	}

};


// Class UDKBase.UDKMapMusicInfo
// 0x00F4 (0x0154 - 0x0060)
class UUDKMapMusicInfo : public UObject
{
public:
	struct FMusicForAMap                               MapMusic;                                                 // 0x0060(0x007C) (Edit)
	struct FStingersForAMap                            MapStingers;                                              // 0x00DC(0x0078) (Edit)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKMapMusicInfo");
		return ptr;
	}

};


// Class UDKBase.UDKParticleSystemComponent
// 0x0014 (0x03C0 - 0x03AC)
class UUDKParticleSystemComponent : public UParticleSystemComponent
{
public:
	float                                              FOV;                                                      // 0x03AC(0x0004) (Const)
	unsigned long                                      bHasSavedScale3D : 1;                                     // 0x03B0(0x0004) (Const)
	struct FVector                                     SavedScale3D;                                             // 0x03B4(0x000C) (Const)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKParticleSystemComponent");
		return ptr;
	}


	void SetFOV(float NewFOV);
};


// Class UDKBase.UDKPawn
// 0x0238 (0x07AC - 0x0574)
class AUDKPawn : public AGamePawn
{
public:
	unsigned long                                      bReadyToDoubleJump : 1;                                   // 0x0574(0x0004)
	unsigned long                                      bRequiresDoubleJump : 1;                                  // 0x0574(0x0004)
	unsigned long                                      bCanDoubleJump : 1;                                       // 0x0574(0x0004)
	unsigned long                                      bNoJumpAdjust : 1;                                        // 0x0574(0x0004)
	unsigned long                                      bIsHoverboardAnimPawn : 1;                                // 0x0574(0x0004)
	unsigned long                                      bFeigningDeath : 1;                                       // 0x0574(0x0004) (Net)
	unsigned long                                      bNotifyStopFalling : 1;                                   // 0x0574(0x0004)
	unsigned long                                      bIsInvisible : 1;                                         // 0x0574(0x0004) (Net)
	unsigned long                                      bSmoothNetUpdates : 1;                                    // 0x0574(0x0004)
	unsigned long                                      bPuttingDownWeapon : 1;                                   // 0x0574(0x0004) (Net)
	unsigned long                                      bPlayingFeignDeathRecovery : 1;                           // 0x0574(0x0004)
	unsigned long                                      bCanPlayFallingImpacts : 1;                               // 0x0574(0x0004)
	unsigned long                                      bEnableFootPlacement : 1;                                 // 0x0574(0x0004)
	unsigned long                                      bPostRenderOtherTeam : 1;                                 // 0x0574(0x0004)
	unsigned long                                      bBlendOutTakeHitPhysics : 1;                              // 0x0574(0x0004)
	unsigned long                                      bUpdateEyeheight : 1;                                     // 0x0574(0x0004)
	unsigned long                                      bTearOffGibs : 1;                                         // 0x0574(0x0004) (Net)
	float                                              MaxDoubleJumpHeight;                                      // 0x0578(0x0004)
	int                                                MultiJumpRemaining;                                       // 0x057C(0x0004)
	int                                                MaxMultiJump;                                             // 0x0580(0x0004)
	int                                                MultiJumpBoost;                                           // 0x0584(0x0004)
	float                                              CustomGravityScaling;                                     // 0x0588(0x0004) (Net)
	struct FPlayEmoteInfo                              EmoteRepInfo;                                             // 0x058C(0x0010) (Net)
	float                                              LastEmoteTime;                                            // 0x059C(0x0004)
	float                                              MinTimeBetweenEmotes;                                     // 0x05A0(0x0004)
	unsigned char                                      BigTeleportCount;                                         // 0x05A4(0x0001) (Net)
	unsigned char                                      WeaponOverlayFlags;                                       // 0x05A5(0x0001) (Net)
	unsigned char                                      UnknownData00[0x2];                                       // 0x05A6(0x0002) MISSED OFFSET
	struct FUTTakeHitInfo                              LastTakeHitInfo;                                          // 0x05A8(0x002C) (Net)
	float                                              LastTakeHitTimeout;                                       // 0x05D4(0x0004)
	float                                              FireRateMultiplier;                                       // 0x05D8(0x0004) (Net)
	float                                              HeadScale;                                                // 0x05DC(0x0004) (Net)
	float                                              MaxSmoothNetUpdateDist;                                   // 0x05E0(0x0004)
	float                                              NoSmoothNetUpdateDist;                                    // 0x05E4(0x0004)
	float                                              SmoothNetUpdateTime;                                      // 0x05E8(0x0004)
	struct FVector                                     MeshTranslationOffset;                                    // 0x05EC(0x000C)
	float                                              OldZ;                                                     // 0x05F8(0x0004)
	class UAudioComponent*                             PawnAmbientSound;                                         // 0x05FC(0x0008) (ExportObject, Component, EditInline)
	class USoundCue*                                   PawnAmbientSoundCue;                                      // 0x0604(0x0008) (Net)
	struct FDrivenWeaponPawnInfo                       DrivenWeaponPawn;                                         // 0x060C(0x0014) (Net)
	class UAudioComponent*                             WeaponAmbientSound;                                       // 0x0620(0x0008) (ExportObject, Component, EditInline)
	class USoundCue*                                   WeaponAmbientSoundCue;                                    // 0x0628(0x0008) (Net)
	class UMaterial*                                   ReplicatedBodyMaterial;                                   // 0x0630(0x0008) (Net)
	TArray<class UMaterialInstanceConstant*>           BodyMaterialInstances;                                    // 0x0638(0x0010) (NeedCtorLink)
	class UMaterialInterface*                          OverlayMaterialInstance;                                  // 0x0648(0x0008) (Net)
	class USkelControlSingleBone*                      RootRotControl;                                           // 0x0650(0x0008)
	class UAnimNodeAimOffset*                          AimNode;                                                  // 0x0658(0x0008)
	class UGameSkelCtrl_Recoil*                        GunRecoilNode;                                            // 0x0660(0x0008)
	class UGameSkelCtrl_Recoil*                        LeftRecoilNode;                                           // 0x0668(0x0008)
	class UGameSkelCtrl_Recoil*                        RightRecoilNode;                                          // 0x0670(0x0008)
	TArray<class AUDKBot*>                             Trackers;                                                 // 0x0678(0x0010) (NeedCtorLink)
	float                                              BodyMatFadeDuration;                                      // 0x0688(0x0004)
	struct FLinearColor                                CurrentBodyMatColor;                                      // 0x068C(0x0010)
	float                                              RemainingBodyMatDuration;                                 // 0x069C(0x0004)
	float                                              ClientBodyMatDuration;                                    // 0x06A0(0x0004) (Net)
	struct FLinearColor                                BodyMatColor;                                             // 0x06A4(0x0010)
	struct FRotator                                    CompressedBodyMatColor;                                   // 0x06B4(0x000C) (Net)
	float                                              StartFallImpactTime;                                      // 0x06C0(0x0004)
	struct FName                                       TorsoBoneName;                                            // 0x06C4(0x0008)
	class USoundCue*                                   FallImpactSound;                                          // 0x06CC(0x0008)
	float                                              FallSpeedThreshold;                                       // 0x06D4(0x0004)
	class UStaticMeshComponent*                        BlobShadow;                                               // 0x06D8(0x0008) (ExportObject, Component, EditInline)
	class USkeletalMeshComponent*                      OverlayMesh;                                              // 0x06E0(0x0008) (ExportObject, Component, EditInline)
	struct FName                                       LeftFootBone;                                             // 0x06E8(0x0008)
	struct FName                                       RightFootBone;                                            // 0x06F0(0x0008)
	struct FName                                       LeftFootControlName;                                      // 0x06F8(0x0008)
	struct FName                                       RightFootControlName;                                     // 0x0700(0x0008)
	float                                              BaseTranslationOffset;                                    // 0x0708(0x0004)
	float                                              CrouchTranslationOffset;                                  // 0x070C(0x0004)
	float                                              OldLocationZ;                                             // 0x0710(0x0004)
	float                                              ZSmoothingRate;                                           // 0x0714(0x0004) (Const)
	float                                              MaxFootPlacementDistSquared;                              // 0x0718(0x0004)
	class USkelControlFootPlacement*                   LeftLegControl;                                           // 0x071C(0x0008)
	class USkelControlFootPlacement*                   RightLegControl;                                          // 0x0724(0x0008)
	class USkelControlLimb*                            LeftHandIK;                                               // 0x072C(0x0008)
	class USkelControlLimb*                            RightHandIK;                                              // 0x0734(0x0008)
	struct FName                                       DamageParameterName;                                      // 0x073C(0x0008)
	struct FName                                       SaturationParameterName;                                  // 0x0744(0x0008)
	float                                              LastPostRenderTraceTime;                                  // 0x074C(0x0004)
	float                                              TeamBeaconMaxDist;                                        // 0x0750(0x0004) (Edit)
	float                                              StartedFallingTime;                                       // 0x0754(0x0004)
	float                                              SlopeBoostFriction;                                       // 0x0758(0x0004)
	class UAnimNodeAimOffset*                          FlyingDirOffset;                                          // 0x075C(0x0008)
	int                                                MaxLeanRoll;                                              // 0x0764(0x0004)
	float                                              FeignDeathPhysicsBlendOutSpeed;                           // 0x0768(0x0004)
	float                                              SwimmingZOffset;                                          // 0x076C(0x0004) (Edit)
	float                                              SwimmingZOffsetSpeed;                                     // 0x0770(0x0004) (Edit)
	float                                              CrouchMeshZOffset;                                        // 0x0774(0x0004)
	float                                              TakeHitPhysicsBlendOutSpeed;                              // 0x0778(0x0004)
	class UUDKSkeletalMeshComponent*                   ArmsMesh[0x2];                                            // 0x077C(0x0008) (ExportObject, Component, EditInline)
	int                                                RootYaw;                                                  // 0x078C(0x0004)
	float                                              RootYawSpeed;                                             // 0x0790(0x0004)
	int                                                MaxYawAim;                                                // 0x0794(0x0004) (Edit)
	struct FVector2D                                   CurrentSkelAim;                                           // 0x0798(0x0008)
	struct FVector                                     HUDLocation;                                              // 0x07A0(0x000C)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKPawn");
		return ptr;
	}


	void StuckFalling();
	void UpdateEyeHeight(float DeltaTime);
	void TakeHitBlendedOut();
	void StartFeignDeathRecoveryAnim();
	void SetHandIKEnabled(bool bEnabled);
	void SetWeaponAttachmentVisibility(bool bAttachmentVisible);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	bool SuggestJumpVelocity(const struct FVector& Destination, const struct FVector& Start, bool bRequireFallLanding, struct FVector* JumpVelocity);
	void StartCrouch(float HeightAdjust);
	void EndCrouch(float HeightAdjust);
	void StoppedFalling();
	void HoldGameObject(class AUDKCarriedObject* UDKGameObj);
	bool IsInvisible();
	struct FVector GetTargetLocation(class AActor* RequestedBy, bool bRequestAlternateLoc);
	void EnsureOverlayComponentLast();
	void RestorePreRagdollCollisionComponent();
	void GetBoundingCylinder(float* CollisionRadius, float* CollisionHeight);
};


// Class UDKBase.UDKPickupFactory
// 0x00C0 (0x0454 - 0x0394)
class AUDKPickupFactory : public APickupFactory
{
public:
	unsigned long                                      bIsRespawning : 1;                                        // 0x0394(0x0004) (Net)
	unsigned long                                      bPulseBase : 1;                                           // 0x0394(0x0004) (Net)
	unsigned long                                      bIsDisabled : 1;                                          // 0x0394(0x0004) (Net)
	unsigned long                                      bFloatingPickup : 1;                                      // 0x0394(0x0004)
	unsigned long                                      bRandomStart : 1;                                         // 0x0394(0x0004)
	unsigned long                                      bRotatingPickup : 1;                                      // 0x0394(0x0004)
	unsigned long                                      bUpdatingPickup : 1;                                      // 0x0394(0x0004)
	unsigned long                                      bDoVisibilityFadeIn : 1;                                  // 0x0394(0x0004)
	class UStaticMeshComponent*                        BaseMesh;                                                 // 0x0398(0x0008) (ExportObject, Transient, Component, EditInline)
	class UMaterialInstanceConstant*                   BaseMaterialInstance;                                     // 0x03A0(0x0008)
	struct FLinearColor                                BaseBrightEmissive;                                       // 0x03A8(0x0010)
	struct FLinearColor                                BaseDimEmissive;                                          // 0x03B8(0x0010)
	float                                              BasePulseRate;                                            // 0x03C8(0x0004)
	float                                              BasePulseTime;                                            // 0x03CC(0x0004)
	float                                              PulseThreshold;                                           // 0x03D0(0x0004)
	struct FLinearColor                                BaseTargetEmissive;                                       // 0x03D4(0x0010)
	struct FLinearColor                                BaseEmissive;                                             // 0x03E4(0x0010)
	struct FName                                       BaseMaterialParamName;                                    // 0x03F4(0x0008)
	float                                              BobTimer;                                                 // 0x03FC(0x0004)
	float                                              BobOffset;                                                // 0x0400(0x0004)
	float                                              BobSpeed;                                                 // 0x0404(0x0004)
	float                                              BobBaseOffset;                                            // 0x0408(0x0004)
	float                                              YawRotationRate;                                          // 0x040C(0x0004)
	struct FVector                                     PivotTranslation;                                         // 0x0410(0x000C)
	struct FName                                       VisibilityParamName;                                      // 0x041C(0x0008)
	class UMaterialInstanceConstant*                   MIC_Visibility;                                           // 0x0424(0x0008)
	class UMaterialInstanceConstant*                   MIC_VisibilitySecondMaterial;                             // 0x042C(0x0008)
	class UParticleSystemComponent*                    Glow;                                                     // 0x0434(0x0008) (ExportObject, Component, EditInline)
	struct FName                                       GlowEmissiveParam;                                        // 0x043C(0x0008)
	class UPrimitiveComponent*                         Spinner;                                                  // 0x0444(0x0008) (ExportObject, Component, EditInline)
	class UUDKParticleSystemComponent*                 SpinningParticleEffects;                                  // 0x044C(0x0008) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKPickupFactory");
		return ptr;
	}


	void SetPickupHidden();
	void SetPickupVisible();
};


// Class UDKBase.UDKPlayerController
// 0x0574 (0x0CB8 - 0x0744)
class AUDKPlayerController : public AGamePlayerController
{
public:
	class UCameraAnimInst*                             CameraAnimPlayer;                                         // 0x0744(0x0008)
	class AUDKEmitCameraEffect*                        CameraEffect;                                             // 0x074C(0x0008)
	unsigned long                                      bDedicatedServerSpectator : 1;                            // 0x0754(0x0004)
	unsigned long                                      bAcuteHearing : 1;                                        // 0x0754(0x0004)
	unsigned long                                      bConsolePlayer : 1;                                       // 0x0754(0x0004)
	unsigned long                                      bPulseTeamColor : 1;                                      // 0x0754(0x0004)
	unsigned long                                      bUsePhysicsRotation : 1;                                  // 0x0754(0x0004)
	struct FVector                                     ShakeOffset;                                              // 0x0758(0x000C)
	struct FRotator                                    ShakeRot;                                                 // 0x0764(0x000C)
	struct FPostProcessSettings                        CamOverridePostProcess;                                   // 0x0770(0x0298) (NeedCtorLink)
	struct FPostProcessSettings                        PostProcessModifier;                                      // 0x0A08(0x0298) (NeedCtorLink)
	TArray<class AActor*>                              PotentiallyHiddenActors;                                  // 0x0CA0(0x0010) (NeedCtorLink)
	float                                              VehicleCheckRadiusScaling;                                // 0x0CB0(0x0004)
	float                                              PulseTimer;                                               // 0x0CB4(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKPlayerController");
		return ptr;
	}


	class APawn* GetTargetAdhesionFrictionTarget(float MaxDistance, struct FVector* CamLoc, struct FRotator* CamRot);
	void ClearCameraEffect();
	void ClientSpawnCameraEffect(class UClass* CameraEffectClass);
	void RemoveCameraEffect(class AUDKEmitCameraEffect* CamEmitter);
	bool IsMouseAvailable();
	bool IsKeyboardAvailable();
	void SetHardwarePhysicsEnabled(bool bEnabled);
	void SetGamma(float GammaValue);
};


// Class UDKBase.UDKPlayerInput
// 0x0000 (0x0550 - 0x0550)
class UUDKPlayerInput : public UMobilePlayerInput
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKPlayerInput");
		return ptr;
	}


	struct FString GetUDKBindNameFromCommand(const struct FString& BindCommand);
};


// Class UDKBase.UDKProfileSettings
// 0x0000 (0x00C4 - 0x00C4)
class UUDKProfileSettings : public UOnlineProfileSettings
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKProfileSettings");
		return ptr;
	}


	void STATIC_ResetKeysToDefault(class ULocalPlayer* InPlayerOwner);
	void ResetToDefault(int ProfileId);
};


// Class UDKBase.UDKProjectile
// 0x0044 (0x02F0 - 0x02AC)
class AUDKProjectile : public AProjectile
{
public:
	unsigned long                                      bWideCheck : 1;                                           // 0x02AC(0x0004) (Net)
	unsigned long                                      bShuttingDown : 1;                                        // 0x02AC(0x0004)
	unsigned long                                      bCheckProjectileLight : 1;                                // 0x02AC(0x0004)
	unsigned long                                      bNotBlockedByShield : 1;                                  // 0x02AC(0x0004)
	float                                              CheckRadius;                                              // 0x02B0(0x0004)
	float                                              AccelRate;                                                // 0x02B4(0x0004)
	class AActor*                                      SeekTarget;                                               // 0x02B8(0x0008) (Net)
	float                                              BaseTrackingStrength;                                     // 0x02C0(0x0004)
	float                                              HomingTrackingStrength;                                   // 0x02C4(0x0004)
	struct FVector                                     InitialDir;                                               // 0x02C8(0x000C) (Net)
	float                                              LastLockWarningTime;                                      // 0x02D4(0x0004)
	float                                              LockWarningInterval;                                      // 0x02D8(0x0004)
	float                                              TerminalVelocity;                                         // 0x02DC(0x0004)
	float                                              Buoyancy;                                                 // 0x02E0(0x0004)
	float                                              CustomGravityScaling;                                     // 0x02E4(0x0004)
	class AVehicle*                                    InstigatorBaseVehicle;                                    // 0x02E8(0x0008) (Net)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKProjectile");
		return ptr;
	}


	void CreateProjectileLight();
	float GetTerminalVelocity();
};


// Class UDKBase.UDKScout
// 0x0018 (0x0624 - 0x060C)
class AUDKScout : public AScout
{
public:
	unsigned long                                      bRequiresDoubleJump : 1;                                  // 0x060C(0x0004)
	float                                              MaxDoubleJumpHeight;                                      // 0x0610(0x0004)
	class UClass*                                      PrototypePawnClass;                                       // 0x0614(0x0008)
	struct FName                                       SizePersonFindName;                                       // 0x061C(0x0008)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKScout");
		return ptr;
	}


	bool SuggestJumpVelocity(const struct FVector& Destination, const struct FVector& Start, bool bRequireFallLanding, struct FVector* JumpVelocity);
};


// Class UDKBase.UDKScriptedNavigationPoint
// 0x0004 (0x036C - 0x0368)
class AUDKScriptedNavigationPoint : public ANavigationPoint
{
public:
	unsigned long                                      bScriptSpecifyEndAnchor : 1;                              // 0x0368(0x0004)
	unsigned long                                      bScriptNotifyAnchorFindingResult : 1;                     // 0x0368(0x0004)
	unsigned long                                      bAnchorMustBeReachable : 1;                               // 0x0368(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKScriptedNavigationPoint");
		return ptr;
	}


	void NotifyAnchorFindingResult(class ANavigationPoint* EndAnchor, class APawn* RouteFinder);
	class ANavigationPoint* SpecifyEndAnchor(class APawn* RouteFinder);
};


// Class UDKBase.UDKSkeletalMeshComponent
// 0x000C (0x07A8 - 0x079C)
class UUDKSkeletalMeshComponent : public USkeletalMeshComponent
{
public:
	float                                              FOV;                                                      // 0x079C(0x0004) (Edit, Const)
	unsigned long                                      bForceLoadTextures : 1;                                   // 0x07A0(0x0004)
	float                                              ClearStreamingTime;                                       // 0x07A4(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKSkeletalMeshComponent");
		return ptr;
	}


	void SetFOV(float NewFOV);
	void PreloadTextures(bool bForcePreload, float ClearTime);
};


// Class UDKBase.UDKTeamOwnedInfo
// 0x0008 (0x0258 - 0x0250)
class AUDKTeamOwnedInfo : public AReplicationInfo
{
public:
	class ATeamInfo*                                   Team;                                                     // 0x0250(0x0008)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKTeamOwnedInfo");
		return ptr;
	}


	unsigned char GetTeamNum();
};


// Class UDKBase.UDKSquadAI
// 0x0050 (0x02A8 - 0x0258)
class AUDKSquadAI : public AUDKTeamOwnedInfo
{
public:
	class AUDKGameObjective*                           SquadObjective;                                           // 0x0258(0x0008) (Net)
	class ANavigationPoint*                            RouteObjective;                                           // 0x0260(0x0008)
	TArray<class ANavigationPoint*>                    ObjectiveRouteCache;                                      // 0x0268(0x0010) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    PreviousObjectiveRouteCache;                              // 0x0278(0x0010) (NeedCtorLink)
	class AUDKBot*                                     PendingSquadRouteMaker;                                   // 0x0288(0x0008)
	int                                                SquadRouteIteration;                                      // 0x0290(0x0004)
	TArray<struct FAlternateRoute>                     SquadRoutes;                                              // 0x0294(0x0010) (NeedCtorLink)
	int                                                MaxSquadRoutes;                                           // 0x02A4(0x0004)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKSquadAI");
		return ptr;
	}

};


// Class UDKBase.UDKTeamPlayerStart
// 0x0014 (0x038C - 0x0378)
class AUDKTeamPlayerStart : public APlayerStart
{
public:
	unsigned char                                      TeamNumber;                                               // 0x0378(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0379(0x0003) MISSED OFFSET
	TArray<class UTexture2D*>                          TeamSprites;                                              // 0x037C(0x0010) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKTeamPlayerStart");
		return ptr;
	}

};


// Class UDKBase.UDKTeleporterBase
// 0x0040 (0x03D4 - 0x0394)
class AUDKTeleporterBase : public ATeleporter
{
public:
	class USceneCaptureComponent*                      PortalCaptureComponent;                                   // 0x0394(0x0008) (Edit, ExportObject, EditConst, Component, EditInline)
	class UTextureRenderTarget2D*                      TextureTarget;                                            // 0x039C(0x0008)
	int                                                TextureResolutionX;                                       // 0x03A4(0x0004) (Edit)
	int                                                TextureResolutionY;                                       // 0x03A8(0x0004) (Edit)
	class AActor*                                      PortalViewTarget;                                         // 0x03AC(0x0008)
	class UMaterialInterface*                          PortalMaterial;                                           // 0x03B4(0x0008)
	class UMaterialInstanceConstant*                   PortalMaterialInstance;                                   // 0x03BC(0x0008)
	struct FName                                       PortalTextureParameter;                                   // 0x03C4(0x0008)
	class USoundCue*                                   TeleportingSound;                                         // 0x03CC(0x0008)

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
 if (!ptr) ptr = UObject::FindClass("Class UDKBase.UDKTeleporterBase");
		return ptr;
	}


	bool Accept(class AActor* Incoming, class AActor* Source);
	void InitializePortalEffect(class AActor* Dest);
	void PostBeginPlay();
};


// Class UDKBase.UDKTrajectoryReachSpec
// 0x0000 (0x00C8 - 0x00C8)
class UUDKTrajectoryReachSpec : public UAdvancedReachSpec
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = nullptr; 
